---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.StructuralWallUsageFilter
source: html/6d77149c-b257-27f7-4e6b-4a2d2d135b0d.htm
---
# StructuralWallUsageFilter Methods

Applies the filter to a given element.